book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-08 Sun 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Science For Jayden's students</title>
<meta name="author" content="Jayden B" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Computer Science For Jayden&rsquo;s students</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org008be9b">1. Preface:</a>
<ul>
<li><a href="#orgf3d762f">1.1. What is this book</a></li>
<li><a href="#orgf3294eb">1.2. Learning Philosophy:</a></li>
<li><a href="#org3e16e4f">1.3. Learning Goals:</a></li>
<li><a href="#org4ecc1dd">1.4. Course Format:</a>
<ul>
<li><a href="#orgb875202">1.4.1. Overview:</a></li>
<li><a href="#org176a8a5">1.4.2. Lectures/Readings:</a></li>
<li><a href="#orgc7e5e6c">1.4.3. Labs:</a></li>
<li><a href="#org9f47ee5">1.4.4. Homework</a></li>
</ul>
</li>
<li><a href="#orgcba9acc">1.5. Week Breakdown:</a>
<ul>
<li><a href="#org45c6faa">1.5.1. W1</a></li>
<li><a href="#org0a888b3">1.5.2. w2:</a></li>
<li><a href="#org28ba9ed">1.5.3. w3:</a></li>
<li><a href="#org5c54f1f">1.5.4. w4:</a></li>
<li><a href="#org03aa2ea">1.5.5. w5:</a></li>
<li><a href="#org7f0b6e2">1.5.6. w6:</a></li>
<li><a href="#org1cff77b">1.5.7. wn:</a></li>
<li><a href="#org2702be5">1.5.8. w11:</a></li>
<li><a href="#org7d475d4">1.5.9. w12:</a></li>
<li><a href="#orgfd8bf22">1.5.10. w13:</a></li>
<li><a href="#org93b90aa">1.5.11. w14:</a></li>
<li><a href="#org2142284">1.5.12. w15:</a></li>
<li><a href="#org3a5b6f2">1.5.13. w16:</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org008be9b" class="outline-2">
<h2 id="org008be9b"><span class="section-number-2">1.</span> Preface:</h2>
<div class="outline-text-2" id="text-1">
<p>
This book is to teach computer science fundamentals in a classroom environment for kids around the age of 11 - 14 with no prior experince.
</p>

<p>
It is specifically made for my use-case, but I thought it could be potentialy benificial to others and so I&rsquo;m releasing it on my github.
</p>

<p>
The book is still a work in progress as I am activley teaching the curiculum expect things to change. As thing get finalized expect it to get cleaner with a lot less of my own personal anecdotes about my teaching strategy.
</p>
</div>
<div id="outline-container-orgf3d762f" class="outline-3">
<h3 id="orgf3d762f"><span class="section-number-3">1.1.</span> What is this book</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This book will also serve as the textbook your students can use!
</p>

<p>
This curiculum is 16 weeks long, and assumes 120 minutes of instructional time a week.
</p>
</div>
</div>
<div id="outline-container-orgf3294eb" class="outline-3">
<h3 id="orgf3294eb"><span class="section-number-3">1.2.</span> Learning Philosophy:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Holistic understanding of concepts, teach them the why and then the how behind (almost) everything they do. Add complexity slowly and intentionally.</li>
<li>Show practical applications of programming quickly to keep them engaged. Imagine if all you did when learning programming was leetcodes. That would suck.</li>
<li>Use professional tools, like the cmd line and git. Build important foudational skills that they&rsquo;ll continue to use regardless of disipline. Not too sure how this&rsquo;ll turn out or how well they&rsquo;ll keep up, but we&rsquo;ll see and adjust.</li>
<li>Give them oppertunities to explore personal interests, let them make stuff that interest them.</li>
</ul>
</div>
</div>
<div id="outline-container-org3e16e4f" class="outline-3">
<h3 id="org3e16e4f"><span class="section-number-3">1.3.</span> Learning Goals:</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>How computers evolved throughout history.</li>
<li>What a computer is, the theoretical and physical parts of one.</li>
<li>The relationship between hardware and software.</li>
<li>How the internet works.</li>
<li>How computer logic is represented</li>
<li>How code turns into binary</li>
<li>Using the command line</li>
<li>Git and version control</li>
<li>Python fundamentals</li>
</ul>
</div>
</div>
<div id="outline-container-org4ecc1dd" class="outline-3">
<h3 id="org4ecc1dd"><span class="section-number-3">1.4.</span> Course Format:</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Each Week is seperated into different sections:
</p>
</div>
<div id="outline-container-orgb875202" class="outline-4">
<h4 id="orgb875202"><span class="section-number-4">1.4.1.</span> Overview:</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>What the students can expect to learn this week</li>
</ul>
</div>
</div>
<div id="outline-container-org176a8a5" class="outline-4">
<h4 id="org176a8a5"><span class="section-number-4">1.4.2.</span> Lectures/Readings:</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Videos or Articles for the students to read</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7e5e6c" class="outline-4">
<h4 id="orgc7e5e6c"><span class="section-number-4">1.4.3.</span> Labs:</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li>Work for students to do in class</li>
</ul>
</div>
</div>
<div id="outline-container-org9f47ee5" class="outline-4">
<h4 id="org9f47ee5"><span class="section-number-4">1.4.4.</span> Homework</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li>Work for students to do outside of class</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcba9acc" class="outline-3">
<h3 id="orgcba9acc"><span class="section-number-3">1.5.</span> Week Breakdown:</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org45c6faa" class="outline-4">
<h4 id="org45c6faa"><span class="section-number-4">1.5.1.</span> W1</h4>
<div class="outline-text-4" id="text-1-5-1">
</div>
<ol class="org-ol">
<li><a id="org55382d6"></a>Overview<br />
<div class="outline-text-5" id="text-1-5-1-1">
<ul class="org-ul">
<li>Give students a simple overview of the fundamentals and hisotry of computer science</li>
</ul>
</div>
</li>
<li><a id="orga576d05"></a>Lecture:<br />
<div class="outline-text-5" id="text-1-5-1-2">
<p>
<a href="https://studio.code.org/projects/applab/iukLbcDnzqgoxuu810unLw">Crash Course Computer Science, from the beginning until Binary</a>
</p>
</div>
</li>
<li><a id="orgb9d3fce"></a>Lab:<br />
<div class="outline-text-5" id="text-1-5-1-3">
<p>
<a href="https://studio.code.org/projects/applab/iukLbcDnzqgoxuu810unLw">Code Studio Binary Game</a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0a888b3" class="outline-4">
<h4 id="org0a888b3"><span class="section-number-4">1.5.2.</span> w2:</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
<a href="https://studio.code.org/projects/applab/iukLbcDnzqgoxuu810unLw">Crash Course Computer Science 6,7,8</a>
</p>
</div>
<ol class="org-ol">
<li><a id="org3297f38"></a>Labs:<br />
<div class="outline-text-5" id="text-1-5-2-1">
<ul class="org-ul">
<li>Have kids prepare a presentation about someone important in computer science. For this section, we&rsquo;re having kids focus on picking a Pioneer, we&rsquo;ll make presentations about innovators later.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgfb516c8"></a>Potential People to make presentations on:<br />
<ol class="org-ol">
<li><a id="org559bc17"></a>Pioneers<br />
<div class="outline-text-7" id="text-1-5-2-1-1-1">
<ul class="org-ul">
<li>Alan Turning</li>
<li>Charles Babbage</li>
<li>Ada Lovelace</li>
<li>Grace Hopper</li>
<li>Margaret Hamilton</li>
<li>Dennis Ritche</li>
<li>Tim Berners-Lee</li>
</ul>
</div>
</li>
<li><a id="org55cbacd"></a>Innovators<br />
<div class="outline-text-7" id="text-1-5-2-1-1-2">
<ul class="org-ul">
<li>John Carmack</li>
<li>Satoshi Nakamoto</li>
<li>Steve Wozniak</li>
<li>Linus Torvalds</li>
<li>Larry Page</li>
<li>Bill Gates</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org2280310"></a>Presentation format:<br />
<div class="outline-text-6" id="text-1-5-2-1-2">
<ul class="org-ul">
<li>Who are they</li>
<li>What led them to computer science</li>
<li>What contributions did they make?</li>
<li>General overview of <i>how</i> they made their contributions (if not too complicated)</li>
<li>Why were there contributions important?</li>
<li>Make sure to cite your sources</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org28ba9ed" class="outline-4">
<h4 id="org28ba9ed"><span class="section-number-4">1.5.3.</span> w3:</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org5c54f1f" class="outline-4">
<h4 id="org5c54f1f"><span class="section-number-4">1.5.4.</span> w4:</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org03aa2ea" class="outline-4">
<h4 id="org03aa2ea"><span class="section-number-4">1.5.5.</span> w5:</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org7f0b6e2" class="outline-4">
<h4 id="org7f0b6e2"><span class="section-number-4">1.5.6.</span> w6:</h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org1cff77b" class="outline-4">
<h4 id="org1cff77b"><span class="section-number-4">1.5.7.</span> wn:</h4>
<div class="outline-text-4" id="text-1-5-7">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org2702be5" class="outline-4">
<h4 id="org2702be5"><span class="section-number-4">1.5.8.</span> w11:</h4>
<div class="outline-text-4" id="text-1-5-8">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org7d475d4" class="outline-4">
<h4 id="org7d475d4"><span class="section-number-4">1.5.9.</span> w12:</h4>
<div class="outline-text-4" id="text-1-5-9">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-orgfd8bf22" class="outline-4">
<h4 id="orgfd8bf22"><span class="section-number-4">1.5.10.</span> w13:</h4>
<div class="outline-text-4" id="text-1-5-10">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org93b90aa" class="outline-4">
<h4 id="org93b90aa"><span class="section-number-4">1.5.11.</span> w14:</h4>
<div class="outline-text-4" id="text-1-5-11">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org2142284" class="outline-4">
<h4 id="org2142284"><span class="section-number-4">1.5.12.</span> w15:</h4>
<div class="outline-text-4" id="text-1-5-12">
<p>
TBD
</p>
</div>
</div>
<div id="outline-container-org3a5b6f2" class="outline-4">
<h4 id="org3a5b6f2"><span class="section-number-4">1.5.13.</span> w16:</h4>
<div class="outline-text-4" id="text-1-5-13">
<p>
TBD
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jayden B</p>
<p class="date">Created: 2024-09-08 Sun 11:51</p>
</div>
</body>
</html>
